INSA-GEI/arm-ada/firmware/v1/Keil/Systeme/Drivers/GLCD_8Bits_STM32.c
/******************************************************************************/
/* GLCD_8bits_STM32.c: STM32 low level Graphic LCD (240x320 pixels) driven    */
/*                       with 8-bit parallel interface INT24BTFT              */
/******************************************************************************/
/* This program is free software: you can redistribute it and/or modify       */
/*    it under the terms of the GNU General Public License as published by    */
/*    the Free Software Foundation, either version 3 of the License, or       */
/*    (at your option) any later version.                                     */
/*                                                                            */
/*    This program is distributed in the hope that it will be useful,         */
/*    but WITHOUT ANY WARRANTY; without even the implied warranty of          */
/*    MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the           */
/*    GNU General Public License for more details.                            */
/*                                                                            */
/*    You should have received a copy of the GNU General Public License       */
/*    along with this program.  If not, see <http://www.gnu.org/licenses/>.   */
/******************************************************************************/

#include "stm32f30x.h"
#include "GLCD.h"

# include "sram.h"
/************************** Orientation  configuration ************************/

#ifndef LANDSCAPE
	#define LANDSCAPE   1                   /* 1 for landscape, 0 for portrait    */
#endif

#ifndef ROTATE180
	#define ROTATE180   0                   /* 1 to rotate the screen for 180 deg */
#endif

/*********************** Hardware specific configuration **********************/
#define GLCD_PIN_RST	GPIO_Pin_10
#define GLCD_PIN_CS		GPIO_Pin_2
#define GLCD_PIN_RS		GPIO_Pin_4
#define GLCD_PIN_WR		GPIO_Pin_9
#define GLCD_PIN_RD		GPIO_Pin_6
#define GLCD_PIN_INT	GPIO_Pin_4
#define GLCD_PIN_WAIT	GPIO_Pin_5
/*------------------------- Speed dependant settings -------------------------*/

/* If processor works on high frequency delay has to be increased, it can be 
   increased by factor 2^N by this constant                                   */
#define DELAY_2N    13

#define NB_NOP_RD		1
#define NB_NOP_WR   0

/*---------------------- Graphic LCD size definitions ------------------------*/

#if (LANDSCAPE == 1)
#define WIDTH       320                 /* Screen Width (in pixels)           */
#define HEIGHT      240                 /* Screen Hight (in pixels)           */
#else
#define WIDTH       240                 /* Screen Width (in pixels)           */
#define HEIGHT      320                 /* Screen Hight (in pixels)           */
#endif
#define BPP         16                  /* Bits per pixel                     */
#define BYPP        ((BPP+7)/8)         /* Bytes per pixel                    */

/*--------------- Graphic LCD interface hardware definitions -----------------*/

#define BG_COLOR  0                     /* Background color                   */
#define TXT_COLOR 1                     /* Text color                         */

#define cSetD0 0x01
#define cSetD1 0x02
#define cSetD2 0x04
#define cSetD3 0x08
#define cSetD4 0x10
#define cSetD5 0x20
#define cSetD6 0x40
#define cSetD7 0x80
#define cClrD0 0xfe
#define cClrD1 0xfd
#define cClrD2 0xfb
#define cClrD3 0xf7
#define cClrD4 0xef
#define cClrD5 0xdf
#define cClrD6 0xbf
#define cClrD7 0x7f

/* Macros for accessing pin */
#define LCD_CS_1	GPIOF->BSRR =  GLCD_PIN_CS
#define LCD_CS_0	GPIOF->BRR =  GLCD_PIN_CS
#define LCD_RS_1	GPIOF->BSRR =  GLCD_PIN_RS
#define LCD_RS_0	GPIOF->BRR =  GLCD_PIN_RS
#define LCD_WR_1	GPIOF->BSRR =  GLCD_PIN_WR
#define LCD_WR_0	GPIOF->BRR =  GLCD_PIN_WR
#define LCD_RD_1	GPIOF->BSRR =  GLCD_PIN_RD
#define LCD_RD_0	GPIOF->BRR =  GLCD_PIN_RD

#define LCD_GET_WAIT (GPIOB->IDR & GLCD_PIN_WAIT)

/*---------------------------- Global variables ------------------------------*/

/******************************************************************************/
static volatile unsigned short Color[2] = {White, Black};

static uint8_t LTPR0_Reg =0;
/************************ Local auxiliary functions ***************************/

/*******************************************************************************
* Delay in while loop cycles                                                   *
*   Parameter:    cnt:    number of while cycles to delay                      *
*   Return:                                                                    *
*******************************************************************************/
static void delay (int cnt) 
{
volatile uint32_t tmp =cnt;
	
  tmp <<= DELAY_2N;
  while (tmp--);
}

/*******************************************************************************
* Set data port as output (for sending data to LCD)                            *
*   Parameter:    																			                       *
*   Return:                                                                    *
*******************************************************************************/
static void set_data_output(void) 
{
uint32_t tmp;

	tmp=GPIOC->MODER ;
	tmp = tmp & 0xFFFF0000; /* met les lignes 0 à 7 en input  */
	tmp = tmp | 0x00005555; /* met les lignes 0 à 7 en output */
	GPIOC->MODER = tmp;
}

/*******************************************************************************
* Set data port as input (for reading data from LCD)                           *
*   Parameter:    																			                       *
*   Return:                                                                    *
*******************************************************************************/
static void set_data_input(void) 
{
	GPIOC->MODER &= 0xFFFF0000; /* met les lignes 0 à 7 en input */
}

