INSA-GEI/arm-ada/firmware/v1/Keil/Systeme/Drivers/GLCD_8Bits_STM32.c
	//set_data_output();
	
	return value;
}

/*******************************************************************************
* Wait while LCD is busy                                                       *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/
static void LCD_CheckBusy(void)
{
	while(LCD_GetStatus()&0x80);
}

/*******************************************************************************
* Switch to text mode                                                          *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/
static void LCD_SetTextMode(void)
{ 
uint8_t temp;

	temp= LCD_RegisterRead(0x40); //MWCR0
	temp |= cSetD7 ;
	LCD_RegisterWrite(0x40,temp);
	temp=LCD_RegisterRead(0x40);
}

/*******************************************************************************
* Switch to graphic mode                                                       *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/
static void LCD_SetGraphicMode(void)
{ 
uint8_t temp;

	//while (LCD_GetStatus() & 0x80); /* attente de la fin de la derniere operation */
	
	temp= LCD_RegisterRead(0x40); //MWCR0
	temp &= ~cSetD7 ;
	LCD_RegisterWrite(0x40,temp);
}

/*******************************************************************************
* Set geometric coordinate for futur drawing operation                         *
*   Parameter: XL,XR,YT,YB: coordinates                                        *
*   Return:                                                                    *
*******************************************************************************/
static void LCD_GeometricCoordinate(uint32_t XL, uint32_t YT, uint32_t XR, uint32_t YB)//
{ 
uint8_t	temp;

	temp=XL;
	LCD_RegisterWrite(0x91,temp);

	temp=XL>>8;
	LCD_RegisterWrite(0x92,temp);
	
	temp=XR;
	LCD_RegisterWrite(0x95,temp);
	
	temp=XR>>8;
	LCD_RegisterWrite(0x96,temp);
	
	temp=YT;
	LCD_RegisterWrite(0x93,temp);
	
	temp=YT>>8;
	LCD_RegisterWrite(0x94,temp);
	
	temp=YB;
	LCD_RegisterWrite(0x97,temp);
	
	temp=YB>>8;
	LCD_RegisterWrite(0x98,temp);
}

/*******************************************************************************
* Set circle coordinates                                                       *
*   Parameter: X,Y,R: coordinates                                              *
*   Return:                                                                    *
*******************************************************************************/
static void LCD_CircleCoordinateRadius(uint32_t X, uint32_t Y, uint32_t R)
{ 
uint8_t temp;

	temp=X;
	LCD_RegisterWrite(0x99,temp);
	
	temp=X>>8;
	LCD_RegisterWrite(0x9a,temp);
	
	temp=Y;
	LCD_RegisterWrite(0x9b,temp);
	
	temp=Y>>8;
	LCD_RegisterWrite(0x9c,temp);
	
	temp=R;
	LCD_RegisterWrite(0x9d,temp);
}

/*******************************************************************************
* Set active area for drawing                                                  *
*   Parameter: XL,XR,YT,YB: coordinate of viewing area rectangle (uint32_t)    *
*   Return:                                                                    *
*******************************************************************************/
static void LCD_SetActiveWindow(uint32_t XL, uint32_t XR ,uint32_t YT ,uint32_t YB)
{
uint8_t temp;
	//setting active window X
	temp=XL;
	LCD_RegisterWrite(0x30,temp); //HSAW0

	temp=XL>>8;
	LCD_RegisterWrite(0x31,temp); //HSAW1
	
	temp=XR;
	LCD_RegisterWrite(0x34,temp);//HEAW0

	temp=XR>>8;
	LCD_RegisterWrite(0x35,temp); //HEAW1

	//setting active window Y
	temp=YT;
	LCD_RegisterWrite(0x32,temp); //VSAW0

	temp=YT>>8;
	LCD_RegisterWrite(0x33,temp);//VSAW1

	temp=YB;
	LCD_RegisterWrite(0x36,temp); //VEAW0

	temp=YB>>8;
	LCD_RegisterWrite(0x37,temp); //VEAW1
}

/*******************************************************************************
* Convert 16 bits color to 8bit color used for text background and foreground  *
*   Parameter: color: 16 bit color                                             *
*   Return: 8 bit color                                                        *
*******************************************************************************/
//static uint8_t LCD_ConvertColor16bTo8b(COLOR color)
//{
//uint8_t temp;
//uint8_t R,G,B;
//	
//		/* color format : RRRRR GGGGGG BBBBB
//	     8 bit color format: RRR GGG BB */
//	
//	R= (color & 0xF800)>>11;
//	G= (color & 0x07E0)>>5;
//	B= (color & 0x001F);
//	
//	R = R >>2;
//	G = G >>3;
//	B = B >>3;
//	
//	temp = (R<<5) + (G<<2) + B;
//	return temp;
//}

/************************ Exported functions **********************************/

/*******************************************************************************
* Wait for LCD ready                                                           *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_Wait(void)
{
GPIO_InitTypeDef GPIO_InitStructure;
	
	/* Attente de 2 secondes */
	delay(3000);
	
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOE, ENABLE);
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_15;
	GPIO_Init(GPIOE, &GPIO_InitStructure);
	
	GPIO_SetBits(GPIOE, GPIO_Pin_15);
}

