INSA-GEI/arm-ada/firmware/v1/Keil/Systeme/Drivers/GLCD_8Bits_STM32.c
/*******************************************************************************
* Initialize the Graphic LCD controller                                        *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_Init (void) 
{
GPIO_InitTypeDef GPIO_InitStructure;
	
volatile unsigned short driverCode;

	/* Configure les lignes */
	RCC_AHBPeriphClockCmd(RCC_AHBPeriph_GPIOB | RCC_AHBPeriph_GPIOC | RCC_AHBPeriph_GPIOF, ENABLE);
	
	/* Config de IT et WAIT */
	GPIO_InitStructure.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_4| GPIO_Pin_5;
	GPIO_Init(GPIOB, &GPIO_InitStructure);
	
	/* Config des lignes de data */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0 | GPIO_Pin_1 | GPIO_Pin_2 | GPIO_Pin_3 | 
	                              GPIO_Pin_4 | GPIO_Pin_5 | GPIO_Pin_6 | GPIO_Pin_7;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
	
	/* Config des lignes de controle */
	/* On met toutes les lignes de controle à '1' */
	GPIO_SetBits(GPIOF, GLCD_PIN_RD | GLCD_PIN_CS | GLCD_PIN_WR  | GLCD_PIN_RS );
	
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;
	GPIO_InitStructure.GPIO_Pin = GLCD_PIN_RD | GLCD_PIN_CS | GLCD_PIN_WR  | GLCD_PIN_RS ;
	GPIO_Init(GPIOF, &GPIO_InitStructure);
	
	/* On passe le bus en sortie */
	set_data_output();
	
	/* Dernieres initialisations de l'ecran */
	LCD_SetActiveWindow(0,319,0,239); // setup display resolution to 320x240 pixels
	LCD_RegisterWrite(0x20,0x89); //Rotation de 90° et HDIR=1
	LCD_RegisterWrite(0x01,0x80); // Display on
	//LCD_RegisterWrite(0x10, 0x08);
	LCD_RegisterWrite(0x10,0x00); // 256 color, parrallel mode
	LCD_RegisterWrite(0x40, 0x0);
}

/*******************************************************************************
* Clear whole screen and paint it with given color                             *
*   Parameter: color: color used for clearing display                          *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_Clear (COLOR color)
{
uint8_t temp;
	
	/* Set background color as color to be used for clearing display */
	temp = LCD_RegisterRead(0x8E); //MCLR
	temp |= cSetD0 ;
	LCD_RegisterWrite(0x8e,temp); //MCLR
	LCD_CheckBusy();
	
	GLCD_SetBackColor(color); /* Set background color */
	
	/* Clear display with background color */
	temp = LCD_RegisterRead(0x8E); //MCLR
	temp |= cSetD7 ;
	LCD_RegisterWrite(0x8e,temp); //MCLR
	LCD_CheckBusy();
}

/*******************************************************************************
* Reset all screen layer, paint all white                                      *
*   Parameter: none                                                            *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_ResetScreen(void)
{
	/* Remember:
	 * Layer 1 is on foreground, layer 2 is background
	 *
   * By default, we use layer 1 (foreground) and set layer 1 transparent by painting it white and set transparent color as white	
	 */
	
	/* Reset scroll */
	
	GLCD_SetLayer(GLCD_LAYER2);
	GLCD_SetTextColor(White);
	GLCD_DrawFillRectangle(0,0,319,239);
	GLCD_ScrollVertical(0);
	GLCD_ScrollHorizontal(0);
	
	GLCD_SetLayer(GLCD_LAYER1);
	GLCD_SetTextColor(White);
	GLCD_DrawFillRectangle(0,0,319,239);
	GLCD_ScrollVertical(0);
	GLCD_ScrollHorizontal(0);
	GLCD_LayerDisplayMode(GLCD_LAYER_DISPLAY_LAYER1);
}

/*******************************************************************************
* Set working area to maximum size (320 * 240 )                                *
*   Parameter:                                                                 *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_WindowMax (void)
{
	LCD_SetActiveWindow(0,319,0,239);
}

/*******************************************************************************
* Set Layer scroll mode                                                        *
*   Parameter:    mode                                                         *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_LayerScrollMode(uint8_t mode)
{
	LTPR0_Reg = LTPR0_Reg & 0x3F;
	LTPR0_Reg = LTPR0_Reg  + (mode & 0xC0);
	LCD_RegisterWrite(0x52, LTPR0_Reg);
}

/*******************************************************************************
* Set Layer scroll mode                                                        *
*   Parameter:    mode                                                         *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_LayerDisplayMode(uint8_t mode)
{
	LTPR0_Reg = LTPR0_Reg & 0xC0;
	LTPR0_Reg = LTPR0_Reg  + (mode & 0x07);
	LCD_RegisterWrite(0x52, LTPR0_Reg);
}

/*******************************************************************************
* Set Layer transparency                                                       *
*   Parameter:    mode                                                         *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_LayerTransparency(uint8_t layer1_trans, uint8_t layer2_trans)
{
	LCD_RegisterWrite(0x53, (layer1_trans & 0x0F)+((layer2_trans & 0x0F)<<4));
}

