INSA-GEI/arm-ada/firmware/v1/Keil/Systeme/Drivers/GLCD_8Bits_STM32.c
	GPIOA->BRR = GPIO_Pin_1 | GPIO_Pin_8 | GPIO_Pin_15 ;
	LCD_CS_0;

	set_data_output();
	write_data(0x02);

	LCD_WR_0;
	
#if (NB_NOP_WR == 1)
	__NOP();
#endif /* NB_NOP_WR == 1 */
	
#if (NB_NOP_WR == 2)
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 2 */
	
#if (NB_NOP_WR == 3)
	__NOP();
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 3 */
	
	LCD_WR_1;
	LCD_CS_1;

	set_data_input();
	
	LCD_CS_0;
	LCD_RS_0;
	
	SRAM_WE_1;
	SRAM_OE_0;
	SRAM_CE_0;
	
	while (i< size)
	{
		/* Positionne l'adresse coté SRAM */
		GPIOD->ODR =  SRAM_Ptr & 0xFFFF;
		if (SRAM_Ptr>65535)
		{
			GPIOA->BRR = GPIO_Pin_1 | GPIO_Pin_8 | GPIO_Pin_15 ;
			GPIOA->ODR |= SRAM_AddrConvertionTable[(SRAM_Ptr>>16)];
		}
		
		while (!LCD_GET_WAIT); /* Attente que le signal wait repasse à 1 (fin du dernier traitement) */
		
		SRAM_Ptr++;
		i++;
	//	__NOP();
	//	__NOP();
	//	__NOP();
		
		LCD_WR_0;
		
#if (NB_NOP_WR == 1)
	__NOP();
#endif /* NB_NOP_WR == 1 */
	
#if (NB_NOP_WR == 2)
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 2 */
	
#if (NB_NOP_WR == 3)
	__NOP();
	__NOP();
	__NOP();
#endif /* NB_NOP_WR == 3 */

		LCD_WR_1;
	}
	
	LCD_RS_1;
	LCD_CS_1;
	
	SRAM_OE_1;
	SRAM_CE_1;
}

/*******************************************************************************
* Set color to be used for foreground                                          *
*   Parameter: color: color to be used for foreground                          *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_SetTextColor (COLOR color)
{
	LCD_RegisterWrite(0x42, color); //TFCR
}
	
/*******************************************************************************
* Set color to be used for background                                          *
*   Parameter: color: color to be used for background                          *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_SetBackColor (COLOR color)
{
	LCD_RegisterWrite(0x43,color);  //TBCR
}

/*******************************************************************************
* Set Cursor coordinate                                                        *
*   Parameter:  X,Y: cursor coordinates(int32_t)                               *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_SetCursor(int32_t X, uint32_t Y)
{ 
uint8_t temp;

	temp=X;
	LCD_RegisterWrite(0x46,temp);
	
	temp=X>>8;
	LCD_RegisterWrite(0x47,temp);
	
	temp=Y;
	LCD_RegisterWrite(0x48,temp);
	
	temp=Y>>8;
	LCD_RegisterWrite(0x49,temp);
}

/*******************************************************************************
* Draw a single character                                                      *
*   Parameter:  X,Y: cursor coordinates(int32_t)                               *
*               c: character to write                                          *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_DrawChar (uint32_t x, uint32_t y, uint8_t  c)
{
uint32_t col,row;
	
	if (x>((320/8)-1)) x= ((320/8)-1);
	if (y>((240/16)-1)) y= ((240/16)-1);
	col = x*8;
	row = (y*16)-1;
	
	LCD_SetTextMode();
	GLCD_SetCursor(col, row);
	
	LCD_RegisterWrite(0x02, c);
	LCD_SetGraphicMode();
}

/*******************************************************************************
* Set Cursor coordinate                                                        *
*   Parameter:  X,Y: cursor coordinates(int32_t)                               *
*               str: string to write                                           *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_DrawString (uint32_t x, uint32_t y, const char *str)
{
int length=0;
uint32_t col,row;
	
	if (x>((320/8)-1)) x= ((320/8)-1);
	if (y>((240/16)-1)) y= ((240/16)-1);
	col = x*8;
	row = (y*16)-1;
	
	LCD_SetTextMode();
	GLCD_SetCursor(col, row);
	
	while(str[length] != '\0')
	{
		length++;
	}
	
	LCD_RegisterWriteBuffer(0x02, (uint8_t *)str, length);
	LCD_SetGraphicMode();
}

/*******************************************************************************
* Draw an ADA formated string (not null terminated)                            *
*   Parameter:  X,Y: cursor coordinates(int32_t)                               *
*               len: length of the string                                      *
*               str: string to write                                           *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_DrawADAString (uint32_t x, uint32_t y, uint32_t len, const char *str)
{
uint32_t col,row;
	
	if (x>((320/8)-1)) x= ((320/8)-1);
	if (y>((240/16)-1)) y= ((240/16)-1);
	col = x*8;
	row = (y*16)-1;
	
	LCD_SetTextMode();
	GLCD_SetCursor(col, row);
	
	LCD_RegisterWriteBuffer(0x02, (uint8_t *)str, len);
	LCD_SetGraphicMode();
}

/*******************************************************************************
* Select font to use                                                           *
*   Parameter:  font: pointer to font descriptor                               *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_SetFont(FONT* font)
{
}

/*******************************************************************************
* Write a single pixel using foreground color                                  *
*   Parameter:  X,Y: cursor coordinates(int32_t)                               *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_PutPixel (uint32_t x, uint32_t y, COLOR color)
{
	GLCD_SetCursor(x, y);
	LCD_RegisterWrite(0x02, color);
}

